# -*- org-export-with-todo-keywords: nil; org-export-use-babel: t; org-edit-src-content-indentation: 2; org-src-preserve-indentation: nil; org-babel-results-keyword: "results"; org-image-actual-width: 1100; org-make-toc-insert-custom-ids: t; org-pandoc-format-extensions: (markdown_github+pipe_tables+raw_html); -*-
#+PROPERTY: HEADER-ARGS                 :eval never-export
#+PROPERTY: HEADER-ARGS:shell           :shebang /bin/bash :prologue "echo '# OUTPUT:'"
#+PROPERTY: HEADER-ARGS:jupyter-python  :session 20241230--06--ether--spikes
#+EXPORT_FILE_NAME: report
#+OPTIONS: toc:nil
#+OPTIONS: tags:nil

* SECTION Test summary                                              :noipynb:
  :PROPERTIES:
  :CUSTOM_ID: test-summary
  :END:

*Test group:* =20250210_gh712_peak_jitter= Testing peak jitter calculation.

*Test:* =06--ether--spikes= Ethernet, short simulated load spikes.

*Date:*

#+begin_src shell :results drawer :exports results :prologue ""
  date "+%a %d %b %Y"
#+end_src

#+results:
:results:
Thu 13 Feb 2025
:end:

*Artifacts:*

| *name*        | *link*            |
|---------------+-------------------|
| receiver dump | [[file:roc_recv.csv.xz][=roc_recv.csv.xz=]] |
| receiver log  | [[file:roc_recv.log.xz][=roc_recv.log.xz=]] |
| sender log    | [[file:roc_send.log.xz][=roc_send.log.xz=]] |

*Jupyter notebook:*

[[file:report.ipynb][=report.ipynb=]]

** Software info

- *git revisions*

   #+begin_src shell :results verbatim :exports both :dir ~/dev/roc-streaming
     cd roc-toolkit && git log -1 --format=short
   #+end_src

   #+results:
   : # OUTPUT:
   : commit a02a89458df136c7dc7585e1f25a7ae1a722afd3
   : Author: Victor Gaydov <victor@enise.org>
   :
   :     scripts: Fixes in rgh.py

   #+begin_src shell :results verbatim :exports both :dir ~/dev/roc-streaming
     cd csvplotter && git log -1 --format=short
   #+end_src

   #+results:
   : # OUTPUT:
   : commit 76e75481d818663166396b03ccc39687fd0a2d1a
   : Author: Victor Gaydov <victor@enise.org>
   :
   :     Add DepacketizerPlotter

- *roc-toolkit version*

   #+begin_src shell :results verbatim :exports both
     roc-recv --version
   #+end_src

   #+results:
   : # OUTPUT:
   : roc-recv 0.4.0 (b2798abb92)

   #+begin_src shell :results verbatim :exports both
     ssh raspberrypi-4b-ubuntu.eth ./roc/roc-send --version
   #+end_src

   #+results:
   : # OUTPUT:
   : roc-send 0.4.0 (b2798abb92)

** Precheck

- *ping*

   #+begin_src shell :results verbatim :exports both
     ping -q -i 0.002 -c 1000 raspberrypi-4b-ubuntu.eth
   #+end_src

   #+results:
   : # OUTPUT:
   : PING raspberrypi-4b-ubuntu.eth (192.168.3.142) 56(84) bytes of data.
   : 
   : --- raspberrypi-4b-ubuntu.eth ping statistics ---
   : 1000 packets transmitted, 1000 received, 0% packet loss, time 1997ms
   : rtt min/avg/max/mdev = 0.107/0.130/0.323/0.017 ms

* SECTION Library code
  :PROPERTIES:
  :CUSTOM_ID: library-code
  :END:

#+begin_export markdown
<details>
  <summary>Click to expand</summary>
#+end_export

#+transclude: [[file:../library.py]]  :src jupyter-python :rest ":results none"

#+begin_export markdown
</details>
#+end_export

#+begin_src jupyter-python :exports both
  data = load_csv('roc_recv.csv')
  data.keys()
#+end_src

#+results:
: dict_keys(['m', 'd', 't', 'f'])

** Statistics

#+begin_src jupyter-python :exports both
  format_tables(stats_table('jitter', data['m'][:,2]),
                stats_table('peak-jitter', data['m'][:,3]/1e6))
#+end_src

#+results:
|       | *jitter*  | *peak-jitter* |
|-------+-----------+---------------|
| *min* | 3.881 ms  | 5.007 ms      |
| *max* | 16.413 ms | 6.152 ms      |
| *avg* | 5.644 ms  | 6.151 ms      |
| *p95* | 5.835 ms  | 6.152 ms      |

** Statistics

#+begin_src jupyter-python :exports both
  format_tables(stats_table('niq-latency', data['t'][:,1]/44100*1e3),
                stats_table('target-latency', data['t'][:,2]/44100*1e3))
#+end_src

#+results:
|       | *niq-latency* | *target-latency* |
|-------+---------------+------------------|
| *min* | 119.184 ms    | 137.279 ms       |
| *max* | 217.914 ms    | 217.687 ms       |
| *avg* | 154.056 ms    | 149.098 ms       |
| *p95* | 209.819 ms    | 217.687 ms       |

  :PROPERTIES:
  :CUSTOM_ID: depacketizer
  :END:

